---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.IsEqual(Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings)
source: html/1809423b-1763-bfc5-0cb6-f25411c95274.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings.IsEqual Method

Compares two deformed shape settings objects.

## Syntax (C#)
```csharp
public bool IsEqual(
	AnalysisDisplayDeformedShapeSettings other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.Analysis.AnalysisDisplayDeformedShapeSettings`) - Deformed shape settings object to compare with.

## Returns
True if objects are equal, false otherwise.